package ch7;

public class Note
{
/*
*         자동차
*  버스        스포츠카     트럭
*  이층버스
*  
*  ---------------
*  
*  Stack FILO  : 중간 index를 꺼낼 수 없음
*  List - 순서기억  - Vector(리스트형 자료구조) : 중간 index를 꺼낼 수 있음
*  따라서 Stack은 Vector이다는 틀린 말.
*  Stack은 Vector이다라는 말은 Stack extends Vector
*  Vector은 중간 index 꺼낼 수 있는데 Stack의 개념에서는 중간에서 못 꺼냄
*  상속받으면 부모가 할 수 있는 거 자식에서 할 수 있어야 하는데 그렇지 못함.
*  
*  ------------
*  프로그램을 만들 때 어떤 기능을 만들 것인가 고민 -> 메소드를 의미 --->
*  요구사항 파악 ( 필요한 기능 )
*  
*  자바에서는 기능을 선언 하는 방법으로 interface라는 문법 제공
*  초보자들은 이 inteface가 어렵다
*  기능을 도출하려면 만들고 싶은 프로그램이 있어야 한다.
*  
*  1. 기능선언 : 인터페이스
*  2. 기능구현 : 클래스
*  인터페이스와 클래스의 관계는 구현의 관계
*  엄밀히 말하면 인터페이스 가 없다는 것은 생각이 없는 것 
*  
*/
}
