package ch10;
/*
 * 접근 지정자, 생성자, this와 super
 */
public class Note
{
/*
 * http://varaneckas.com/jad
 * jad : java decomplier 중의 하나
 * 디컴파일러 : class -> 자바소스코드
 * 
 * 생성자를 하나도 만들지 않으면, 
 * 컴파일 할 때 아무일도 하지 않는 기본 생성자가 자동으로 만들어진다.
 * 
 * 클래스가 생성자를 하나라도 가지고 있다면 기본생성자가 만들어지지 않는다.
 * 
 * 생성자에도 throws가 있을 수 있으니 API문서 잘 보기!!!
 * 
 * 인스턴스를 만든다는 것은 메모리에 하니씩 인스턴스가 만들어짐
 * 인스턴스를 만든다는 것은 인스턴사간의 구별
 * 인스턴스간의 구별은 속성으로 구별, 속성 : 인스턴스 변수
 * 2명의 학생이 있다면.... 그 학생의 이름.
 * 2명의 학생이 있다는 그 자체, 구별, 인스턴스를 사용
 * 인스턴스를 구별할 필요가 없을 경우 즉 인스턴스를 만들필요가 없는 경우에 private
 */
}
