package ch15_Object_String;

public class Note
{
	/*
	 * equals 값을 비교한는 메서드
	 * == 같은 레퍼런스냐?
	 * 
	 * 객체와 객체가 값이 같은지 라는 것을 알려면
	 * 학생 2명이 있다. 2명의 학생은 같은가?
	 * 같은가? 라는 것을 말할려면 기준을 정해야 한다.
	 * equals도 알맞게 오버라이딩 해야 한다.
	 * 
	 * Object의 equals 메소드는 오버라이딩을 목적으로 제공
	 * 메소드가 오버라이딩되면 무조건 자식의 메소드가 된다
	 * 값이 같은지 비교하려면 기준이 있어야 하는데, 이 기준은 객체를
	 * 만드는 사람만 기준을 잡을 수 있다.
	 * 
	 * equals와 hasCode
	 * 
	 * 단순값만비교 할 때는 equals만 해도 되는데
	 * Set이나 Map의 키는 유일한 값이어야 한다.
	 * 따라서 Hash알고리즘을 사용 hashCode()
	 * 
	 * 
	 */
}
